src/InformationRegisters/Scan_ИсторияИзмененияДанныхПоСОП/Scan_ИсторияИзмененияДанныхПоСОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияИзмененияДанныхПоСОП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_СтавкиНДС</types>
      <types>EnumRef.Scan_ВидыДоговоров</types>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.Scan_СтатусыОплатПоСОП</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоСОП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КалендарныеГрафики/КалендарныеГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КалендарныеГрафики</name>
  <resources>
    <name>ДеньВключенВГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейВГрафикеСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаГрафика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СоставСоглашенийОПоставке/Scan_СоставСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СоставСоглашенийОПоставке</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </resources>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ХарактеристикиЗаказовНаЗавод/Scan_ХарактеристикиЗаказовНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ХарактеристикиЗаказовНаЗавод</name>
  <comment>История заказов на завод  (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
      <types>EnumRef.Scan_ТипыЗаказовНаЗавод</types>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.Scan_КомплектностьПоставкиЗначения</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_OrderIntake/Scan_OrderIntake.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_OrderIntake</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользоватьВОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДаты</name>
    <type>
      <types>EnumRef.Scan_ДатыДляФормированияОтчетаOI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод/Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод</name>
  <enumValues>
    <name>ADD</name>
    <comment>10271</comment>
  </enumValues>
  <enumValues>
    <name>CDD</name>
  </enumValues>
  <enumValues>
    <name>CDD2</name>
  </enumValues>
  <enumValues>
    <name>CDDX</name>
  </enumValues>
  <enumValues>
    <name>CDDY</name>
  </enumValues>
  <enumValues>
    <name>CDDПоставщик</name>
  </enumValues>
  <enumValues>
    <name>DDDeviation</name>
  </enumValues>
  <enumValues>
    <name>DDPriority</name>
  </enumValues>
  <enumValues>
    <name>DealerID_COW</name>
  </enumValues>
  <enumValues>
    <name>FFUНомер</name>
  </enumValues>
  <enumValues>
    <name>IDExternalSystem</name>
  </enumValues>
  <enumValues>
    <name>MarketChange</name>
    <comment>14327</comment>
  </enumValues>
  <enumValues>
    <name>PartPeriod</name>
    <comment>14312</comment>
  </enumValues>
  <enumValues>
    <name>SOrderНомер</name>
  </enumValues>
  <enumValues>
    <name>АвтомобильПроданСоСканияРусь</name>
  </enumValues>
  <enumValues>
    <name>ВывозИзПорта</name>
  </enumValues>
  <enumValues>
    <name>ГотовностьТС</name>
  </enumValues>
  <enumValues>
    <name>ДатаБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>ДатаГрузовогоБилета</name>
  </enumValues>
  <enumValues>
    <name>ДатаОбновления</name>
  </enumValues>
  <enumValues>
    <name>ЕстьАдресДоставки</name>
  </enumValues>
  <enumValues>
    <name>ЕстьБукингЛист</name>
  </enumValues>
  <enumValues>
    <name>ЗаводскойСтатусЗаказа</name>
    <comment>14223</comment>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>ЗаказчикCOW</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыНаЗакупкуПредставление</name>
  </enumValues>
  <enumValues>
    <name>ЗапретНаИзменениеСкладаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Клиент</name>
    <comment>14327</comment>
  </enumValues>
  <enumValues>
    <name>КодАдресаДоставки</name>
  </enumValues>
  <enumValues>
    <name>КомплектностьПоставки</name>
  </enumValues>
  <enumValues>
    <name>Кузовостроитель</name>
  </enumValues>
  <enumValues>
    <name>КузовщикиПредставление</name>
  </enumValues>
  <enumValues>
    <name>МестоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеАдмПродажОтправлено</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеДилерамОтправлено</name>
  </enumValues>
  <enumValues>
    <name>НомерБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>НомерГрузовогоБилета</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноОП</name>
  </enumValues>
  <enumValues>
    <name>ОдобреноПолучениеПродукта</name>
  </enumValues>
  <enumValues>
    <name>ПолученГрузовойБилет</name>
  </enumValues>
  <enumValues>
    <name>ПортСПБ</name>
  </enumValues>
  <enumValues>
    <name>ПоступилМашинокомплект</name>
  </enumValues>
  <enumValues>
    <name>ПродавецЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ПродуктГотов</name>
  </enumValues>
  <enumValues>
    <name>ПродуктГотовКПродаже</name>
  </enumValues>
  <enumValues>
    <name>ПродуктДатаГотовности</name>
  </enumValues>
  <enumValues>
    <name>СкладОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>СозданВручную</name>
  </enumValues>
  <enumValues>
    <name>СтатусЗаказа</name>
    <comment>14226</comment>
  </enumValues>
  <enumValues>
    <name>Тахограф</name>
  </enumValues>
  <enumValues>
    <name>ТипЗаказаНаЗавод</name>
    <comment>14226</comment>
  </enumValues>
  <enumValues>
    <name>ТОВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ТягачШасси</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ДатыДляФормированияОтчетаOI/Scan_ДатыДляФормированияОтчетаOI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДатыДляФормированияОтчетаOI</name>
  <comment>Bспользуется в регистре «Order intake»</comment>
  <enumValues>
    <name>ПодтверждениеЗавода</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДатаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ДатаРасторжения</name>
  </enumValues>
  <enumValues>
    <name>ТипЗаказаНеOpen</name>
  </enumValues>
  <enumValues>
    <name>ЛокальныйCтатусПродуктаНеDELETED</name>
  </enumValues>
  <enumValues>
    <name>ЛокальныйCтатусПродуктаDELETED</name>
  </enumValues>
  <enumValues>
    <name>ДатаOrderIntake</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_СтатусыОплатПоСОП/Scan_СтатусыОплатПоСОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_СтатусыОплатПоСОП</name>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>ОплаченоЧастично</name>
  </enumValues>
  <enumValues>
    <name>НеОплачено</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаНеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаОтсутствует</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаПолученаНесоответствуетГрафику</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаПолученаСоответствуетГрафику</name>
  </enumValues>
  <enumValues>
    <name>ПредоплатаВнесенаПолностью</name>
  </enumValues>
  <enumValues>
    <name>ОплаченоПолностью</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ДополнительнаяИнформацияПоСОП/Scan_ДополнительнаяИнформацияПоСОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоСОП</name>
  <enumValues>
    <name>НомерДоговора</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Валюта</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ДатаНачала</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ДатаОкончания</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Бессрочный</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>IDExternalSystem</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ОсновнойДоговор</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СтатусОплаты</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СрокПоставки</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>МестоПоставки</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>Количество</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>ЦенаПродажиБезНДС</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СуммаПродажиБезНДС</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьБезНДС</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>Себестоимость</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>ДатаОбновления</name>
    <comment>СОП</comment>
  </enumValues>
  <enumValues>
    <name>СуммаПоСОПБезНДС</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьСуммаБезНДС</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьСумма</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЗавод</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>Изделие</name>
    <comment>не используется</comment>
  </enumValues>
  <enumValues>
    <name>Владелец</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ВидДоговора</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Компания</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>СтавкаНДС</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ВключаетНДС</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Недействителен</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>Расторгнут</name>
    <comment>используется</comment>
  </enumValues>
  <enumValues>
    <name>ДатаРасторжения</name>
    <comment>используется</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ВидыДилеров/Scan_ВидыДилеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыДилеров</name>
  <enumValues>
    <name>Независимый</name>
  </enumValues>
  <enumValues>
    <name>Собственный</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/Scan_ИсторияИзмененияДанныхПоСОП/ManagerModule.bsl
//rarus vikhle 27.09.2021 АПК +- + инструкции и область
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Обработать данные по order intake
//
// Параметры:
//  ТаблицаЗаписей	 - ТаблицаЗначений	 - 
//  Период			 - Дата	 - 
//  ВосстановлениеЗаписей - Булево - Признак восстановления записей по стандартному OI
//
//Процедура ОбработатьДанныеДляOrderIntake(ТаблицаЗаписей, Период = Неопределено) Экспорт //rarus vikhle 05.09.2021 mt 18212 +++
Процедура ОбработатьДанныеДляOrderIntake(ТаблицаЗаписей, Период = Неопределено, ВосстановлениеЗаписей = Ложь) Экспорт // rarus agar 11.02.2022 17739
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(КалендарныеГрафики.ДатаГрафика) КАК ДатаГрафика
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|ГДЕ
		|	КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
		|	И КалендарныеГрафики.Год = &Год
		|	И КалендарныеГрафики.ДеньВключенВГрафик = ИСТИНА";
	
	Запрос.УстановитьПараметр("Год",		 Год(Период));
	Запрос.УстановитьПараметр("ТекущаяДата", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РабочаяДата = ТекущаяДатаСеанса();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РабочаяДата = ВыборкаДетальныеЗаписи.ДатаГрафика;
	КонецЦикла;
	РабочаяДата = НачалоДня(РабочаяДата);
	                   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Период КАК Период,
		|	ТЗ.Договор КАК Договор,
		|	ТЗ.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ТЗ_Типизация
		|ИЗ
		|	&ТаблицаЗаписей КАК ТЗ
		|ГДЕ
		|	ТЗ.Значение В(&МассивЗначений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.Договор КАК Договор,
		|	ВЫРАЗИТЬ(Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Справочник.Scan_Изделия) КАК Продукт
		|ПОМЕСТИТЬ ПродуктыСОП
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.Договор В
		|			(ВЫБРАТЬ
		|				ВТ_ТЗ_Типизация.Договор КАК Договор
		|			ИЗ
		|				ВТ_ТЗ_Типизация КАК ВТ_ТЗ_Типизация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ_Типизация.Период КАК Период,
		|	ВТ_ТЗ_Типизация.Договор КАК Договор,
		|	ВТ_ТЗ_Типизация.Значение КАК Значение,
		|	ЕСТЬNULL(ПродуктыСОП.Продукт, ЗНАЧЕНИЕ(Справочник.Scan_Изделия.ПустаяСсылка)) КАК Продукт
		|ПОМЕСТИТЬ ТЗ_Продукты
		|ИЗ
		|	ВТ_ТЗ_Типизация КАК ВТ_ТЗ_Типизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПродуктыСОП КАК ПродуктыСОП
		|		ПО ВТ_ТЗ_Типизация.Договор = ПродуктыСОП.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_Продукты.Период КАК Период,
		|	ТЗ_Продукты.Договор КАК Договор,
		|	ТЗ_Продукты.Значение КАК Значение,
		|	ТЗ_Продукты.Продукт.ЗаказНаЗавод КАК ПродуктЗаказНаЗавод,
		//rarus vikhle 03.09.2021 mt 18212 +++
		|	ВЫРАЗИТЬ(Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних.Значение КАК Перечисление.Scan_ТипыЗаказовНаЗавод) КАК ТипЗаказа
		//rarus vikhle 03.09.2021 mt 18212 ---
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	ТЗ_Продукты КАК ТЗ_Продукты
		//rarus vikhle 03.09.2021 mt 18212 +++
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ХарактеристикиЗаказовНаЗавод.СрезПоследних(
		|				,
		|				Заказ В
		|						(ВЫБРАТЬ
		|							ТЗ_Продукты.Продукт.ЗаказНаЗавод КАК ПродуктЗаказНаЗавод
		|						ИЗ
		|							ТЗ_Продукты КАК ТЗ_Продукты)
		|					И Реквизит = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод)) КАК Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних
		|		ПО ТЗ_Продукты.Продукт.ЗаказНаЗавод = Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних.Заказ
		//rarus vikhle 03.09.2021 mt 18212 ---
		|ГДЕ
		|	ТЗ_Продукты.Продукт.БУ = ЛОЖЬ
		//rarus vikhle 03.09.2021 mt 18212 +++
		|	И ВЫРАЗИТЬ(Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних.Значение КАК Перечисление.Scan_ТипыЗаказовНаЗавод) В (&ТипыЗаказаFirm)
		//rarus vikhle 03.09.2021 mt 18212 ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ.Договор КАК Договор,
		|	ВТ_ТЗ.Период КАК ПериодБазовый,
		|	ВТ_ТЗ.Значение КАК ЗначениеБазовое,
		|	ВТ_ТЗ.ПродуктЗаказНаЗавод КАК ПродуктЗаказНаЗавод,
		|	Scan_OrderIntakeСрезПоследних.ЗаказНаЗавод КАК ЗаказНаЗавод,
		|	Scan_OrderIntakeСрезПоследних.Период КАК ПериодВнесенияОплаты,
		|	Scan_OrderIntakeСрезПоследних1.ЗаказНаЗавод КАК ЗаказНаЗавод1,
		|	Scan_OrderIntakeСрезПоследних1.Период КАК ПериодПодтверждениеЗавода,
		|	Scan_OrderIntakeСрезПоследних2.ЗаказНаЗавод КАК ЗаказНаЗавод2,
		|	Scan_OrderIntakeСрезПоследних2.Период КАК ПериодДатыРасторжения
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_OrderIntake.СрезПоследних(, ВидДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты)) КАК Scan_OrderIntakeСрезПоследних
		|		ПО ВТ_ТЗ.ПродуктЗаказНаЗавод = Scan_OrderIntakeСрезПоследних.ЗаказНаЗавод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_OrderIntake.СрезПоследних(, ВидДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ДатыДляФормированияОтчетаOI.ПодтверждениеЗавода)) КАК Scan_OrderIntakeСрезПоследних1
		|		ПО ВТ_ТЗ.ПродуктЗаказНаЗавод = Scan_OrderIntakeСрезПоследних1.ЗаказНаЗавод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_OrderIntake.СрезПоследних(, ВидДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ДатыДляФормированияОтчетаOI.ДатаРасторжения)) КАК Scan_OrderIntakeСрезПоследних2
		|		ПО ВТ_ТЗ.ПродуктЗаказНаЗавод = Scan_OrderIntakeСрезПоследних2.ЗаказНаЗавод";
	//rarus vikhle 25.03.2021 mt 17526 ---
	
	Запрос.УстановитьПараметр("ТаблицаЗаписей", ТаблицаЗаписей);
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.Оплачено);
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ОплаченоЧастично);	
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаПолученаНесоответствуетГрафику);	
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаПолученаСоответствуетГрафику);
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаВнесенаПолностью);
	МассивЗначений.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ОплаченоПолностью);	  	
	
	Запрос.УстановитьПараметр("МассивЗначений", МассивЗначений);
	//rarus vikhle 03.09.2021 mt 18212 +++
	ТипыЗаказаFirm = Перечисления.Scan_ТипыЗаказовНаЗавод.ТипыЗаказаFirm();
	Запрос.УстановитьПараметр("ТипыЗаказаFirm", ТипыЗаказаFirm);
	//rarus vikhle 03.09.2021 mt 18212 ---
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//rarus vikhle 28.09.2021 mt 17739 +++
		//Если АльтернативныйРасчет Тогда
		//	ВидДилера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Договор, "Компания.ВидДилера");
		//	Если ВидДилера <> Перечисления.Scan_ВидыДилеров.Собственный Тогда
		//		МенеджерЗаписи = РегистрыСведений.Scan_РасчетOrderIntake.СоздатьМенеджерЗаписи();
		//		МенеджерЗаписи.Период       = Период;
		//		МенеджерЗаписи.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
		//		МенеджерЗаписи.Событие      = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
		//		МенеджерЗаписи.ДатаСобытия  = РабочаяДата;
		//		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		//		УстановитьПривилегированныйРежим(Истина);
		//		МенеджерЗаписи.Записать();
		//		УстановитьПривилегированныйРежим(Ложь);
		//	КонецЕсли;
		//КонецЕсли;
		//rarus vikhle 28.09.2021 mt 17739 ---
		
		Если не значениеЗаполнено(Выборка.ЗаказНаЗавод) Тогда // нет состояния "внесение оплаты", надо добавить
			
			НоваяЗапись = РегистрыСведений.Scan_OrderIntake.СоздатьМенеджерЗаписи();  
			НоваяЗапись.Период = РабочаяДата;
			НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
			НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
			НоваяЗапись.Прочитать();
			Если не НоваяЗапись.Выбран() Тогда
				НоваяЗапись.Период = РабочаяДата;
				НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
				НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
				НоваяЗапись.ИспользоватьВОтчетах = Истина; //rarus vikhle 21.03.2021 mt 17479
				НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
				НоваяЗапись.Записать();
			КонецЕсли;
			
			Если значениеЗаполнено(Выборка.ЗаказНаЗавод1) Тогда // не было состояния "внесение оплаты", но было подтверждение завода, надо добавить статус Order Intake
				НоваяЗапись = РегистрыСведений.Scan_OrderIntake.СоздатьМенеджерЗаписи();  
				НоваяЗапись.Период = ?(РабочаяДата > Выборка.ПериодПодтверждениеЗавода,РабочаяДата, Выборка.ПериодПодтверждениеЗавода);
				НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ДатаOrderIntake;
				НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
				НоваяЗапись.Прочитать();
				Если не НоваяЗапись.Выбран() Тогда
					НоваяЗапись.Период = ?(РабочаяДата > Выборка.ПериодПодтверждениеЗавода,РабочаяДата, Выборка.ПериодПодтверждениеЗавода);
					НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ДатаOrderIntake;
					НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
					НоваяЗапись.ИспользоватьВОтчетах = Истина; //rarus vikhle 21.03.2021 mt 17479
					НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
					НоваяЗапись.Записать();
				КонецЕсли;
			КонецЕсли; 	
			//rarus vikhle 28.09.2021 mt 17739 +++
			// rarus agar 15.09.2021 17739 ++
			//Если АльтернативныйРасчет Тогда
			//	ВидДилера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Договор, "Компания.ВидДилера");
			//	Если ВидДилера <> Перечисления.Scan_ВидыДилеров.Собственный Тогда
			//		МенеджерЗаписи = РегистрыСведений.Scan_РасчетOrderIntake.СоздатьМенеджерЗаписи();
			//		МенеджерЗаписи.Период       = ТекущаяДатаСеанса();
			//		МенеджерЗаписи.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
			//		МенеджерЗаписи.Событие      = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
			//		МенеджерЗаписи.ДатаСобытия  = РабочаяДата;
			//		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			//		УстановитьПривилегированныйРежим(Истина);
			//		МенеджерЗаписи.Записать();
			//		УстановитьПривилегированныйРежим(Ложь);
			//	КонецЕсли;
			//КонецЕсли;
			// rarus agar 15.09.2021 17739 --
			//rarus vikhle 28.09.2021 mt 17739 ---
		Иначе	// было состояние "внесение оплаты"
			// проверим было ли расторжение этого состояния, если да, то зафиксируем новое "внесение оплаты"
			Если значениеЗаполнено(Выборка.ЗаказНаЗавод2) Тогда
				Если Выборка.ПериодДатыРасторжения >= Выборка.ПериодВнесенияОплаты И 
					Выборка.ПериодДатыРасторжения <= РабочаяДата Тогда
					
					НоваяЗапись = РегистрыСведений.Scan_OrderIntake.СоздатьМенеджерЗаписи();  
					НоваяЗапись.Период = РабочаяДата;
					НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
					НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
					НоваяЗапись.Прочитать();
					Если не НоваяЗапись.Выбран() Тогда
						НоваяЗапись.Период = РабочаяДата;
						НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
						НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
						НоваяЗапись.ИспользоватьВОтчетах = Истина; //rarus vikhle 21.03.2021 mt 17479
						НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
						НоваяЗапись.Записать();
					КонецЕсли;
					
					Если значениеЗаполнено(Выборка.ЗаказНаЗавод1) Тогда // зафиксировано "внесение оплаты", но ранее было подтверждение завода, надо добавить статус Order Intake
						НоваяЗапись = РегистрыСведений.Scan_OrderIntake.СоздатьМенеджерЗаписи(); 
						НоваяЗапись.Период = ?(РабочаяДата > Выборка.ПериодПодтверждениеЗавода,РабочаяДата, Выборка.ПериодПодтверждениеЗавода);
						НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ДатаOrderIntake;
						НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
						НоваяЗапись.Прочитать();
						Если не НоваяЗапись.Выбран() Тогда
							НоваяЗапись.Период = ?(РабочаяДата > Выборка.ПериодПодтверждениеЗавода,РабочаяДата, Выборка.ПериодПодтверждениеЗавода);
							НоваяЗапись.ВидДаты = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ДатаOrderIntake;
							НоваяЗапись.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
							НоваяЗапись.ИспользоватьВОтчетах = Истина; //rarus vikhle 21.03.2021 mt 17479
							НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
							НоваяЗапись.Записать();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//rarus vikhle 28.09.2021 mt 17739 +++
				// rarus agar 15.09.2021 17739 ++
				//Если АльтернативныйРасчет Тогда
				//	ВидДилера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Договор, "Компания.ВидДилера");
				//	Если ВидДилера <> Перечисления.Scan_ВидыДилеров.Собственный Тогда
				//		МенеджерЗаписи = РегистрыСведений.Scan_РасчетOrderIntake.СоздатьМенеджерЗаписи();
				//		//МенеджерЗаписи.Период       = ТекущаяДатаСеанса();
				//		МенеджерЗаписи.Период       = Период; //rarus vikhle 07.09.2021 mt 18212
				//		МенеджерЗаписи.ЗаказНаЗавод = Выборка.ПродуктЗаказНаЗавод;
				//		МенеджерЗаписи.Событие      = Перечисления.Scan_ДатыДляФормированияОтчетаOI.ВнесениеОплаты;
				//		МенеджерЗаписи.ДатаСобытия  = РабочаяДата;
				//		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				//		УстановитьПривилегированныйРежим(Истина);
				//		МенеджерЗаписи.Записать();
				//		УстановитьПривилегированныйРежим(Ложь);
				//	КонецЕсли;
				//КонецЕсли;
				// rarus agar 15.09.2021 17739 --
				//rarus vikhle 28.09.2021 mt 17739 ---
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	// rarus agar 29.12.2021 17739 ++
	АльтернативныйРасчет = Scan_ПраваИНастройки.Scan_Право("ИспользоватьАльтернативныйРасчетДатOrderIntake");
	Если АльтернативныйРасчет И Не ВосстановлениеЗаписей Тогда // rarus agar 11.02.2022 17739
		СтатусыНеОплачено = Новый Массив;
		СтатусыНеОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.НеОплачено);
		СтатусыНеОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.НеТребуется);
		СтатусыНеОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаНеТребуется);
		СтатусыНеОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаОтсутствует);
		
		СтатусыОплачено = Новый Массив;
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.Оплачено);
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ОплаченоЧастично);
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаПолученаНесоответствуетГрафику);
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаПолученаСоответствуетГрафику);
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ПредоплатаВнесенаПолностью);
		СтатусыОплачено.Добавить(Перечисления.Scan_СтатусыОплатПоСОП.ОплаченоПолностью);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("П1", ТаблицаЗаписей);
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаНабораЗаписей.Период КАК Период,
		|	ВЫРАЗИТЬ(ТаблицаНабораЗаписей.Договор КАК Справочник.Scan_ДоговорыВзаиморасчетов) КАК Договор,
		|	ТаблицаНабораЗаписей.Значение КАК СтатусОплаты
		|ПОМЕСТИТЬ ВТ_СтатусОплаты
		|ИЗ
		|	&П1 КАК ТаблицаНабораЗаписей
		|ГДЕ
		|	ТаблицаНабораЗаписей.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоСОП.СтатусОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.Договор КАК Договор,
		|	ВЫРАЗИТЬ(Scan_СоставСоглашенийОПоставкеСрезПоследних.Изделие КАК Справочник.Scan_Изделия) КАК Продукт
		|ПОМЕСТИТЬ ВТ_ПродуктыСоглашения
		|ИЗ
		|	РегистрСведений.Scan_СоставСоглашенийОПоставке.СрезПоследних КАК Scan_СоставСоглашенийОПоставкеСрезПоследних
		|ГДЕ
		|	Scan_СоставСоглашенийОПоставкеСрезПоследних.СоглашениеОПоставке.Договор В
		|			(ВЫБРАТЬ
		|				ВТ_СтатусОплаты.Договор КАК Договор
		|			ИЗ
		|				ВТ_СтатусОплаты КАК ВТ_СтатусОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтатусОплаты.Период КАК Период,
		|	ВТ_СтатусОплаты.Договор КАК Договор,
		|	ВТ_СтатусОплаты.СтатусОплаты КАК СтатусОплаты,
		|	ЕСТЬNULL(ВТ_ПродуктыСоглашения.Продукт, ЗНАЧЕНИЕ(Справочник.Scan_Изделия.ПустаяСсылка)) КАК Продукт
		|ПОМЕСТИТЬ ВТ_Продукты
		|ИЗ
		|	ВТ_СтатусОплаты КАК ВТ_СтатусОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродуктыСоглашения КАК ВТ_ПродуктыСоглашения
		|		ПО ВТ_СтатусОплаты.Договор = ВТ_ПродуктыСоглашения.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Продукты.Период КАК Период,
		|	ВТ_Продукты.Договор КАК Договор,
		|	ВТ_Продукты.СтатусОплаты КАК СтатусОплаты,
		|	ВТ_Продукты.Продукт КАК Продукт,
		|	ВТ_Продукты.Продукт.ЗаказНаЗавод КАК ЗаказНаЗавод
		|ИЗ
		|	ВТ_Продукты КАК ВТ_Продукты
		|ГДЕ
		|	НЕ ВТ_Продукты.Продукт.БУ
		|	И ВТ_Продукты.Договор.Компания.ВидДилера <> ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДилеров.Собственный)";
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если СтатусыОплачено.Найти(Выборка.СтатусОплаты) <> Неопределено Тогда
				Scan_OrderIntake.ЗарегистрироватьПоступлениеОплаты(Выборка.Период, Выборка.ЗаказНаЗавод);
			ИначеЕсли СтатусыНеОплачено.Найти(Выборка.СтатусОплаты) <> Неопределено Тогда
				Scan_OrderIntake.ЗарегистрироватьОтменуОплаты(Выборка.Период, Выборка.ЗаказНаЗавод);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// rarus agar 29.12.2021 17739 --
	
КонецПроцедуры //rarus vikhle 05.09.2021 mt 18212 ---	


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
